In [40]:
import pandas as pd
import numpy as np

In [4]:
import pandas as pd
data = pd.read_csv('C:/Users/User/Desktop/ML hub/Machine learning project/end to end project/age_of_marriage_data.csv')
print(data.shape)
data.head()

(2567, 10)

,id,gender,height,religion,caste,mother_tongue,profession,location,country,age_of_marriage
0,1,female,"5'4""",NaN,others,Telugu,NaN,London,United Kingdom,21.0
1,2,male,"5'7""",Jain,Shwetamber,Gujarati,Doctor / Healthcare Professional,Fairfax- VA,USA,32.0
2,3,male,"5'7""",Hindu,Brahmin,Hindi,Entrepreneurs / Business,Begusarai,India,32.0
3,4,female,"5'0""",Hindu,Thakur,Hindi,Architect,Mumbai,India,30.0
4,5,male,"5'5""",Christian,Born Again,Malayalam,Sales Professional / Marketing,Sulthan Bathery,India,30.0

In [5]:
data.isnull().any()

id                 False
gender              True
height              True
religion            True
caste               True
mother_tongue       True
profession          True
location            True
country             True
age_of_marriage     True
dtype: bool

In [6]:
data.isnull().sum()

id                   0
gender              29
height             118
religion           635
caste              142
mother_tongue      164
profession         330
location           155
country             16
age_of_marriage     19
dtype: int64

In [9]:
(data.shape[0] - data.dropna().shape[0])/data.shape[0]

0.24737047136735488

In [13]:
## drop the nan values
data.dropna(inplace=True)

In [14]:
data.shape

(1932, 10)

In [15]:
data.head()

,id,gender,height,religion,caste,mother_tongue,profession,location,country,age_of_marriage
1,2,male,"5'7""",Jain,Shwetamber,Gujarati,Doctor / Healthcare Professional,Fairfax- VA,USA,32.0
2,3,male,"5'7""",Hindu,Brahmin,Hindi,Entrepreneurs / Business,Begusarai,India,32.0
3,4,female,"5'0""",Hindu,Thakur,Hindi,Architect,Mumbai,India,30.0
4,5,male,"5'5""",Christian,Born Again,Malayalam,Sales Professional / Marketing,Sulthan Bathery,India,30.0
5,6,male,"5'5""",Hindu,Valmiki,Hindi,Sportsman,Delhi,India,29.0

In [16]:

data.profession.unique()

array(['Doctor / Healthcare Professional', 'Entrepreneurs / Business ',
       'Architect', 'Sales Professional / Marketing', 'Sportsman',
       'Banking Professional', 'Software Professional', 'HR Professional',
       'Finance Professional', 'Not Specified', 'Not working',
       'Chartered Accountant', 'Logistics and Travel Professional',
       'Defense Services', 'Team Member / Staff',
       'Managers and Senior Executives', 'Admin Professional',
       'Accounting Professional (Others)', 'Investment Professional',
       'Civil Engineer', 'Consultant / Supervisor / Team Leads',
       'Public Relations Professional', 'Training Professional (Others)',
       'Hotel & Hospitality Professional (Others)',
       'Software Professional (Others)', 'Nurse', 'Artist (Others)',
       'Non IT Engineer (Others)', 'Event Manager',
       'Marketing Professional', 'Science Professional (Others)',
       'Mechanical / Production Engineer', 'Research Assistant',
       'Electronics / Telecom Engineer', 'Teacher', 'Professor',
       'Interior Designer', 'Fashion Designer', 'Beautician',
       'Software Consultant',
       'Medical / Healthcare Professional (Others)',
       'Agent / Broker / Trader / Contractor', 'Lawyer',
       'Hardware & Networking professional', 'Web / UX Designers',
       'Pharmacist', 'Research Scholar', 'Actor',
       'Entertainment Professional', 'Student',
       'Customer Support / BPO / KPO Professional', 'Designer (Others)',
       'Media Professional', 'Physiotherapist / Occupational Therapist',
       'Merchant Naval Officer', 'VP / AVP / GM / DGM',
       'CxO / Chairman / Director / President', 'IAS / IRS / IES / IFS',
       'Writer', 'Lecturer', 'Other Airline Professional',
       'Social Worker / Volunteer / NGO', 'Jewellery Designer',
       'Company Secretary', 'Mariner', 'Chef / Sommelier / Food Critic',
       'Law Enforcement Employee (Others)', 'Hairstylist',
       'Agricultural Professional (Others)', 'Farming',
       'Landscape Architect', 'Psychologist', 'Legal Assistant',
       'Dentist', 'Surgeon', 'Legal Professional (Others)',
       'Air Hostess / Flight Attendant', 'Advertising Professional',
       'Indian Police Services [IPS]', 'Medical Transcriptionist',
       'Physician Assistant', 'Commercial Artist',
       'Veterinary Doctor / Healthcare Professional', 'Pilot / Co-Pilot'],
      dtype=object)

In [17]:
X = data.loc[:,['gender','height','religion','caste','mother_tongue','country']]
y = data.age_of_marriage

In [18]:
X.head()

   gender height   religion        caste mother_tongue country
1    male   5'7"       Jain   Shwetamber      Gujarati     USA
2    male   5'7"      Hindu      Brahmin         Hindi   India
3  female   5'0"      Hindu       Thakur         Hindi   India
4    male   5'5"  Christian   Born Again     Malayalam   India
5    male   5'5"      Hindu      Valmiki         Hindi   India

In [19]:
from sklearn.preprocessing import LabelEncoder
enc = LabelEncoder()
X.loc[:,['gender','religion','caste','mother_tongue','country']]= \
X.loc[:,['gender','religion','caste','mother_tongue','country']].apply(enc.fit_transform)

In [20]:

X.head()

  gender height religion caste mother_tongue country
1      1   5'7"        2    34             6      19
2      1   5'7"        1    14             8       5
3      0   5'0"        1    36             8       5
4      1   5'5"        0    13            13       5
5      1   5'5"        1    38             8       5

In [21]:
int(X.loc[1,'height'].split('\'')[0])*30.48

152.4

In [22]:
int(X.loc[1,'height'].split('\'')[1].replace('"',''))*2.54

17.78

In [23]:
def h_cms(h):
    return int(h.split('\'')[0])*30.48+\
    int(h.split('\'')[1].replace('"',''))*2.54

In [24]:
X['height_cms'] = X.height.apply(h_cms)

In [25]:
X.head()

  gender height religion caste mother_tongue country  height_cms
1      1   5'7"        2    34             6      19      170.18
2      1   5'7"        1    14             8       5      170.18
3      0   5'0"        1    36             8       5      152.40
4      1   5'5"        0    13            13       5      165.10
5      1   5'5"        1    38             8       5      165.10

In [26]:
X.drop('height',inplace=True,axis=1)

In [27]:
X.head()

  gender religion caste mother_tongue country  height_cms
1      1        2    34             6      19      170.18
2      1        1    14             8       5      170.18
3      0        1    36             8       5      152.40
4      1        0    13            13       5      165.10
5      1        1    38             8       5      165.10

In [28]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=0)

In [29]:

from sklearn.ensemble import RandomForestRegressor
model = RandomForestRegressor(n_estimators=80,max_depth=11)
model.fit(X_train,y_train)
y_predict = model.predict(X_test)

In [30]:
from sklearn.metrics import mean_absolute_error, r2_score
print("MAE : ", mean_absolute_error(y_test,y_predict))
r2_score(y_test,y_predict)

MAE :  1.0392999895840078

0.6973075362641632

In [34]:
from sklearn.externals import joblib
joblib.dump(model,'C:/Users/User/Desktop/ML hub/Machine learning project/end to end project/marriage_age_predict_model.ml')

['C:/Users/User/Desktop/ML hub/Machine learning project/end to end project/marriage_age_predict_model.ml']

In [46]:
import sklearn

In [47]:
print(sklearn.__version__)

0.22